# 實作練習作業

#### 資料來源:[Bank Marketing](https://archive.ics.uci.edu/ml/datasets/Bank+Marketing)

### 使用上述連結中的DataFolder -> bank.zip -> bank-full.csv檔案來進行此次作業
壓縮檔的bank-names.txt有各欄位介紹，請務必詳加閱讀

In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv('bank-full.csv', sep=';') #此檔案是用sep分割的，而非預設的tab空格

In [4]:
df

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45206,51,technician,married,tertiary,no,825,no,no,cellular,17,nov,977,3,-1,0,unknown,yes
45207,71,retired,divorced,primary,no,1729,no,no,cellular,17,nov,456,2,-1,0,unknown,yes
45208,72,retired,married,secondary,no,5715,no,no,cellular,17,nov,1127,5,184,3,success,yes
45209,57,blue-collar,married,secondary,no,668,no,no,telephone,17,nov,508,4,-1,0,unknown,no
45210,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other,no

# Q1.請計算樣本中年齡的平均數、標準差、中位數及四分位數

In [5]:
df["age"].describe()

count    45211.000000
mean        40.936210
std         10.618762
min         18.000000
25%         33.000000
50%         39.000000
75%         48.000000
max         95.000000
Name: age, dtype: float64

# Q2. 請計算樣本中各種職業各有多少人

In [6]:
df.groupby("job").size()

job
admin.           5171
blue-collar      9732
entrepreneur     1487
housemaid        1240
management       9458
retired          2264
self-employed    1579
services         4154
student           938
technician       7597
unemployed       1303
unknown           288
dtype: int64

# Q3. 計算樣本中有多少用戶加入定期存款 多少沒有(y)

In [7]:
df.groupby("y").size()

y
no     39922
yes     5289
dtype: int64

# Q4. 根據你計算的結果，請問整體樣本中行銷成功的比例是多少

In [8]:
df[df["y"]=="yes"].shape[0]/(df.shape[0])

0.11698480458295547

# Q5. 根據你計算的結果，請問不同教育背景族群，行銷成功的比例各是多少

In [9]:
a5=pd.DataFrame(df.groupby(["education","y"])["y"].count())
a5

                   y
education y
primary   no    6260
          yes    591
secondary no   20752
          yes   2450
tertiary  no   11305
          yes   1996
unknown   no    1605
          yes    252

In [10]:
df["ynew"]=df['y'].apply(lambda x: 1 if x=="yes" else 0)
df.groupby("education")["ynew"].mean()

education
primary      0.086265
secondary    0.105594
tertiary     0.150064
unknown      0.135703
Name: ynew, dtype: float64

# Q6. 請問有多少客戶是前一波活動，就有進行行銷的對象

In [11]:
len(df[df["previous"]!=0])

8257

# Q7. 撇除unknown以及other，請問前一次活動中成功行銷跟不成功行銷客戶，對這次活動成功買帳的比率是多少

In [12]:
pd.DataFrame(df.groupby(["poutcome","y"])["y"].count())

                  y
poutcome y
failure  no    4283
         yes    618
other    no    1533
         yes    307
success  no     533
         yes    978
unknown  no   33573
         yes   3386

In [13]:
a=["other","unknown"]
new=df[~df['poutcome'].isin(a)]
new.groupby("poutcome")["ynew"].mean()

poutcome
failure    0.126097
success    0.647253
Name: ynew, dtype: float64

# Q8. 將年齡層分為(0-10), (11-20)... 請問各年齡層每年平均帳戶餘額是多少

In [14]:
def cut_age(x):
    
    if 10<x<=20:
        return 1
    elif 20<x<=30:
        return 2
    elif 30<x<=40:
        return 3
    elif 40<x<=50:
        return 4
    elif 50<x<=60:
        return 5
    elif 60<x<=70:
        return 6
    elif 70<x<=80:
        return 7
    elif 80<x<=90 :
        return 8
    else:
        return 9
df['age_cut']=df["age"].apply(cut_age)
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,ynew,age_cut
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no,0,5
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no,0,4
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no,0,3
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no,0,4
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no,0,3

In [15]:
df.groupby("age_cut")["balance"].mean()

age_cut
1     674.824742
2    1024.781480
3    1235.003336
4    1368.076519
5    1737.709681
6    2512.837375
7    2796.608247
8    3573.858696
9     945.142857
Name: balance, dtype: float64